   #                        PANDAS
 
* Panel Data
* Veri Manipülasyonu ve veri analizi için yazılmış açık kaynak kodlu bir Python kütüphanesidir
* Ekonometrik ve finansal çalışmalar için doğmuştur
* Temeli 2008 yılında atılmıştır
* R DataFrame yapısını Python dünyasına taşımış ve DataFrame'ler üzerinde hızlı ve etkili çalışabilme imkanı sağlamıştır.
* Bir çok farklı veri tipini okuma ve yazma imkanı sağlar.

### Pandas Serisi Oluşturma

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5]) 
#Numpy Arrayleri gibi yani bir  veri tipidir
# indeks bilgili tutar

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
pd.Series([15,35,98])

0    15
1    35
2    98
dtype: int64

In [4]:
seri=pd.Series([15,35,98]) 
type(seri)

pandas.core.series.Series

In [5]:
seri.axes 
#serinin indeks bilgilerine ulaşırız
#0dan 3e kadar 1er 1er artmış

[RangeIndex(start=0, stop=3, step=1)]

In [6]:
seri.size #içerisindeki eleman sayyısı

3

In [7]:
seri.ndim #boyut bilgisi

1

In [8]:
seri.values
#indekssiz değer bilgilerine ulaşmak istediğimizde(array )

array([15, 35, 98], dtype=int64)

In [10]:
seri.head(2) #ilk 2 gözlemini getirir

0    15
1    35
dtype: int64

In [12]:
seri.tail(1) #son bir elemanını

2    98
dtype: int64

In [13]:
#indeks isimlendirilmesi

In [14]:
pd.Series([99,22,332,94,5])

0     99
1     22
2    332
3     94
4      5
dtype: int64

In [15]:
pd.Series([99,22,332,94,5],index=["a","b","c","d","e"])

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [17]:
seri=pd.Series([99,22,332,94,5],
               index=["a","b","c","d","e"])
seri["a"]

99

In [18]:
#sozluk üzerinden pandas serisi oluşturmak

In [19]:
sozluk=pd.Series({"reg":10,"log":11,"cart":12})
sozluk

reg     10
log     11
cart    12
dtype: int64

In [20]:
type(sozluk)

pandas.core.series.Series

In [21]:
#iki seri birleştirerek seri oluşturma

In [22]:
pd.concat([sozluk,sozluk]) #alt alta birleştirdi

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

 ##### ****Eleman İşlemleri****

In [23]:
import numpy as np
a=np.array([1,2,33,444,75])
seri=pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [24]:
seri[0]

1

In [25]:
seri[0:3] #3.indekse kadar

0     1
1     2
2    33
dtype: int32

In [27]:
seri = pd.Series([121,200,150,99],
                 index = ["reg","loj","cart","rf"])

In [28]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [29]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [31]:
list(seri.items()) #key-value şeklinde gelmesini istersek

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [32]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [33]:
#Eleman Sorgulama

In [34]:
 "reg" in seri #reg serinin içinde mi - true(evet)

True

In [35]:
"a" in seri

False

In [ ]:
#fancy işlem

In [36]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [37]:
seri["reg":"loj"]

reg    121
loj    200
dtype: int64

### Pandas DataFrame Oluşturma
* Pandas DataFrame:yapısal bir veri tipidir

In [38]:
import pandas as pd
l = [1,2,39,67,90]
l

[1, 2, 39, 67, 90]

In [39]:
pd.DataFrame(l,columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [44]:
import numpy as np
m=np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [45]:
pd.DataFrame(m,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [46]:
#df isimlendirme

In [47]:
df=pd.DataFrame(m,columns=["var1","var2","var3"])

In [50]:
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [52]:
df.columns=("deg1","deg2","deg3")

In [53]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [54]:
type(df)

pandas.core.frame.DataFrame

In [55]:
df.axes #satır ve sütun bilgileri

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [56]:
df.shape #boyut bilgisini

(3, 3)

In [57]:
df.ndim #boyutsorgusu(2boyut-satır,sütun)

2

In [58]:
df.size

9

In [59]:
df.values #arraye çevirdi

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [60]:
a = np.array([1,2,3,4,5])

In [61]:
pd.DataFrame(a,columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

 ### ****Eleman İşlemleri****

In [62]:
import numpy as np
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [63]:
sozluk={"var1":s1,
       "var2":s2,
       "var3":s3}

In [64]:
sozluk

{'var1': array([9, 3, 9, 1, 0]),
 'var2': array([8, 4, 1, 6, 9]),
 'var3': array([2, 8, 1, 4, 2])}

In [79]:
df=pd.DataFrame(sozluk)
df

   var1  var2  var3
0     9     8     2
1     3     4     8
2     9     1     1
3     1     6     4
4     0     9     2

In [70]:
df[0:1]

   var1  var2  var3
a     9     8     2

In [80]:
df.index=["a","b","c","d","e"]
df

   var1  var2  var3
a     9     8     2
b     3     4     8
c     9     1     1
d     1     6     4
e     0     9     2

In [71]:
df["c":"e"]

   var1  var2  var3
c     9     1     1
d     1     6     4
e     0     9     2

In [72]:
#SİlME

In [73]:
df.drop("a",axis=0) 
#veri setinde kalıcı bir değişiklik olmadı

   var1  var2  var3
b     3     4     8
c     9     1     1
d     1     6     4
e     0     9     2

In [74]:
df #a duruyor

   var1  var2  var3
a     9     8     2
b     3     4     8
c     9     1     1
d     1     6     4
e     0     9     2

In [81]:
df.drop("a",axis=0,inplace=True)  
#inplace argümanıyla kalıcı hale getirdik
#axis=0 satırı,axis=1 sütunu gösterir

In [82]:
df # a kalıcı olarak silindi

   var1  var2  var3
b     3     4     8
c     9     1     1
d     1     6     4
e     0     9     2

In [85]:
df.drop(["c","d"],axis=0)

   var1  var2  var3
b     3     4     8
c     9     1     1
d     1     6     4
e     0     9     2

In [86]:
l=["var1","var4","var3"]

for i in l:
    print(i in df)

True
False
True

In [90]:
df["var4"] =df["var1"] * df["var2"]

In [91]:
df

   var1  var2  var3  var4
b     3     4     8    12
c     9     1     1     9
d     1     6     4     6
e     0     9     2     0

In [92]:
#degisken silmek

In [93]:
df.drop("var4",axis=1,inplace=True)

In [94]:
df

   var1  var2  var3
b     3     4     8
c     9     1     1
d     1     6     4
e     0     9     2

###  ****Gözlem ve Değişken Seçimi****

* LOC
* ILOC

In [95]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    13    12    13
1    18    26     7
2     9     6     7
3    19    27    21
4    12    23    13
5     2     6    20
6     2    21    19
7    10    17     6
8    19     8    27
9     8    26     4

In [96]:
#LOC : Tanımlandığı şekli ile seçim yapmak için kullanılır

In [98]:
df.loc[0:3] #3de alır

   var1  var2  var3
0    13    12    13
1    18    26     7
2     9     6     7
3    19    27    21

In [99]:
#iloc : alışık olduğumuz indeksleme mantığıyla seçim yapar

In [101]:
df.iloc[0:3] #3 e kadar

   var1  var2  var3
0    13    12    13
1    18    26     7
2     9     6     7

In [106]:
df.iloc[0,0]

13

In [107]:
df.iloc[:3,:2]

   var1  var2
0    13    12
1    18    26
2     9     6

In [108]:
df.loc[0:3,"var3"]  #indekse sadık kalıyor

0    13
1     7
2     7
3    21
Name: var3, dtype: int32

In [111]:
df.iloc[0:3]["var3"]

0    13
1     7
2     7
Name: var3, dtype: int32

###  ****Koşullu  Eleman  İşlemleri****

In [112]:
df

   var1  var2  var3
0    13    12    13
1    18    26     7
2     9     6     7
3    19    27    21
4    12    23    13
5     2     6    20
6     2    21    19
7    10    17     6
8    19     8    27
9     8    26     4

In [114]:
df["var1"]

0    13
1    18
2     9
3    19
4    12
5     2
6     2
7    10
8    19
9     8
Name: var1, dtype: int32

In [115]:
#birinci değişkende ki değerlerin 15den büyük olanlarını istersek

In [117]:
df[df.var1 > 15]["var1"]

1    18
3    19
8    19
Name: var1, dtype: int32

In [120]:
df[(df.var1 > 15) & (df.var3 < 21)]

   var1  var2  var3
1    18    26     7

In [121]:
df[df.var1 > 15][["var1","var2"]]

   var1  var2
1    18    26
3    19    27
8    19     8

In [122]:
df.loc[(df.var1 > 15),["var1","var2"]]

   var1  var2
1    18    26
3    19    27
8    19     8

###  ****Birleştirme(Join) İşlemleri****

In [124]:
df

   var1  var2  var3
0    13    12    13
1    18    26     7
2     9     6     7
3    19    27    21
4    12    23    13
5     2     6    20
6     2    21    19
7    10    17     6
8    19     8    27
9     8    26     4

In [125]:
df2= df + 99

In [126]:
df2

   var1  var2  var3
0   112   111   112
1   117   125   106
2   108   105   106
3   118   126   120
4   111   122   112
5   101   105   119
6   101   120   118
7   109   116   105
8   118   107   126
9   107   125   103

In [127]:
pd.concat([df,df2]) 
#indeksler iki kere 0dan başlıyor

   var1  var2  var3
0    13    12    13
1    18    26     7
2     9     6     7
3    19    27    21
4    12    23    13
5     2     6    20
6     2    21    19
7    10    17     6
8    19     8    27
9     8    26     4
0   112   111   112
1   117   125   106
2   108   105   106
3   118   126   120
4   111   122   112
5   101   105   119
6   101   120   118
7   109   116   105
8   118   107   126
9   107   125   103

In [128]:
pd.concat([df,df2],ignore_index=True) 
#indeks sorunu çözüldü

    var1  var2  var3
0     13    12    13
1     18    26     7
2      9     6     7
3     19    27    21
4     12    23    13
5      2     6    20
6      2    21    19
7     10    17     6
8     19     8    27
9      8    26     4
10   112   111   112
11   117   125   106
12   108   105   106
13   118   126   120
14   111   122   112
15   101   105   119
16   101   120   118
17   109   116   105
18   118   107   126
19   107   125   103

In [131]:
df.columns=["var1","var2","deg3"]
df

   var1  var2  deg3
0    13    12    13
1    18    26     7
2     9     6     7
3    19    27    21
4    12    23    13
5     2     6    20
6     2    21    19
7    10    17     6
8    19     8    27
9     8    26     4

In [133]:
pd.concat([df,df2]) #birinde deg3 var birinde deg3 var. aynı sütun değil

   var1  var2  deg3   var3
0    13    12  13.0    NaN
1    18    26   7.0    NaN
2     9     6   7.0    NaN
3    19    27  21.0    NaN
4    12    23  13.0    NaN
5     2     6  20.0    NaN
6     2    21  19.0    NaN
7    10    17   6.0    NaN
8    19     8  27.0    NaN
9     8    26   4.0    NaN
0   112   111   NaN  112.0
1   117   125   NaN  106.0
2   108   105   NaN  106.0
3   118   126   NaN  120.0
4   111   122   NaN  112.0
5   101   105   NaN  119.0
6   101   120   NaN  118.0
7   109   116   NaN  105.0
8   118   107   NaN  126.0
9   107   125   NaN  103.0

In [135]:
pd.concat([df,df2],join="inner") 
#değişkenler bazında kesişimlerine göre birleştiri)

   var1  var2
0    13    12
1    18    26
2     9     6
3    19    27
4    12    23
5     2     6
6     2    21
7    10    17
8    19     8
9     8    26
0   112   111
1   117   125
2   108   105
3   118   126
4   111   122
5   101   105
6   101   120
7   109   116
8   118   107
9   107   125

In [142]:
?pd.concat

Signature:
pd.concat(
    objs: Union[Iterable[~FrameOrSeries], Mapping[Union[Hashable, NoneType], ~FrameOrSeries]],
    axis=0,
    join='outer',
    ignore_index: bool = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: bool = False,
    sort: bool = False,
    copy: bool = True,
) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionadded:: 0.23.0
    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\basak\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [149]:
#İLERİ BİRLEŞTİRME İŞLEMLERİ

In [51]:
import numpy as np
import pandas as pd

#birebir birleştirme

In [4]:
df1=pd.DataFrame({"calisanlar":["Ali","Veli","Ayse","Fatma"],
                 "grup":["Muhasebe","Muhendislik","Muhendislik","IK"]})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [5]:
df2=pd.DataFrame({"calisanlar":["Ali","Veli","Ayse","Fatma"],
                 "ilk_giris":[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [7]:
pd.merge(df1,df2)
#birebir birleştirme(hangi degişkene göre yapacagini kendi anlar)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [8]:
pd.merge(df1,df2,on="calisanlar")
#hangi degskenin uzerine birlestirmek istedigimizi yazadabiliriz

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [9]:
#coktan teke birlestirme

In [10]:
df3=pd.merge(df1,df2)

In [11]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [12]:
df4=pd.DataFrame({"grup":["Muhasebe","Muhendislik","IK"],
                 "mudur":["Caner","Mustafa","Berkcan"]})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [17]:
df5=pd.merge(df3,df4)
df5

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Muhendislik       2009  Mustafa
2       Ayse  Muhendislik       2014  Mustafa
3      Fatma           IK       2019  Berkcan

In [14]:
#coktan coka birlestirme

In [16]:
df6=pd.DataFrame({"grup":["Muhasebe","Muhasebe","Muhendislik","Muhendislik","IK","IK"],
                 "yetenekler":["matematik","excel","kodlama","linux","excel","yonetim"]})
df6

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [18]:
pd.merge(df5,df6)

  calisanlar         grup  ilk_giris    mudur yetenekler
0        Ali     Muhasebe       2010    Caner  matematik
1        Ali     Muhasebe       2010    Caner      excel
2       Veli  Muhendislik       2009  Mustafa    kodlama
3       Veli  Muhendislik       2009  Mustafa      linux
4       Ayse  Muhendislik       2014  Mustafa    kodlama
5       Ayse  Muhendislik       2014  Mustafa      linux
6      Fatma           IK       2019  Berkcan      excel
7      Fatma           IK       2019  Berkcan    yonetim

###  ****Toplulaştırma(Aggregation) ve Gruplama(Grouping)****

**Basit Toplulaştırma fonksiyonları:**

* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [19]:
import seaborn as sns

In [22]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\users\basak\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [21]:
df = sns.load_dataset("planets")

In [23]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [24]:
df.mean() #bütün değişkenlerin ortalaması

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [25]:
df["mass"].mean()

2.6381605847953233

In [26]:
df.describe().T #bütün istatistiksel sonuçları verilmiş

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [27]:
df.dropna().describe().T #eksik gözlemleri silip ssonuçları ver

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

 ### **Gruplama İşlemleri**

 ****Gruplama İşlemi:**** Veri setinde yer alan Kategorik değişkenli gruplarının yakalanması ve bu grupların özelinde bazı işlemler yapılması demektir.

In [29]:
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                 "veri":[10,11,52,23,43,55]},columns=["gruplar","veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [34]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [35]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [36]:
df = sns.load_dataset("planets")

In [37]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [39]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [43]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

### **İleri Toplulaştırma İşlemleri**
* Aggregate
* filter
* transform
* apply

In [44]:
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                 "degisken1":[10,23,33,22,11,99],
                "degisken2":[100,253,333,262,111,969]},
                columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969


 
 ## **aggregate**

In [48]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

#KENDİMİZ ÖZELLİKLE BİR İSTATİSTİK İSTİYORSAK YANİ DESCRİBE'NİN İÇERİSİNDEKİLER DEĞİL SADECE MOD MEDYAN DA DEĞİL.

#KİŞİSEL İSTEKLERİMİZİ AGGREGATE FONKSİYONUNU KULLANARAK ÇAĞIRABİLİRİZ

In [77]:
import numpy as np

In [53]:
df.groupby("gruplar").aggregate(["min","count",np.median,max])

#dışardan başka bir fonksiyon çağırma ihtiyacını np.median deyip numpydan ağırdık
#pandasın içerisinde olan fonksiyonu tırnaklı ya da tırnaksız çağırabiliriz("min" ya da max dedik)

        degisken1                  degisken2
              min count median max       min count median  max
gruplar
A              10     2     16  22       100     2    181  262
B              11     2     17  23       111     2    182  253
C              33     2     66  99       333     2    651  969

In [55]:
df.groupby("gruplar").aggregate({"degisken1":"min",
                                "degisken2":"max"})

#degisken 1 in minlerini getir y degisken2 nin maxlarını dediğimizde sözlük yapısı kullanırız

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

 ## **filter**
 
 **Fonksiyonumu  kendim tanımlamam ve bunu bir koşulcasına dfnin içerisindeki değişkenlerin üzerine göndermek gerekiyor..**
 
 **Kendi Kişisel fonksiyonlarımızı bir filtreleme aracımız değişkenlerin üzerinde sorgulamak işlemini filter işlemiyle ele alınacak**

In [59]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [68]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [69]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [60]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

 ## **transform**
 
**Veri setimizin değişkenlerine bir  dönüştürme yapmak istiyoruz ve bu dönüştürme işleminide kendimiz tanımlamak istiyoruz**

In [74]:
df_a=df.iloc[:,1:]
df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [76]:
df_a.transform(lambda x: (x-x.mean())/x.std())  #standart normal dönüşümü

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

 ## **Apply**
**Değişkenlerin üzerinde gezinme yeteneği olan ve aggregation yani toplulaştırma amacıyla kullanılan bir fonksiyondur**

In [78]:
df=pd.DataFrame({"degisken1":[10,23,33,22,11,99],
                "degisken2":[100,253,333,262,111,969]},
                columns=["degisken1","degisken2"])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [79]:
df.apply(np.sum) #sütun bazında

degisken1     198
degisken2    2028
dtype: int64

In [82]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

## **PİVOT TABLOLAR**

**Veri setleri üzerinde bazı satır ve sütun işlemleri yaparak veri setine amaca uygun hale getirmek için kullanılan yapılardır**

In [83]:
import pandas as pd
import seaborn as sns
titanic=sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [84]:
#cinsiyete göre gruplayıp sağ kalma(survived) değişkenini inceleyelim

In [90]:
titanic.groupby("sex")[["survived"]].mean() 
#ilkel bir pivotlama işlemi yapmış olduk.sağ kalmaya göre

        survived
sex
female  0.742038
male    0.188908

In [94]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [95]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean") .unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [96]:
titanic.groupby(["sex","class"])[["survived"]].mean().unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

**pivot ile pivot table**

In [98]:
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [99]:
age = pd.cut(titanic["age"],[0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [100]:
titanic.pivot_table("survived",["sex",age],"class") 
#age'i dışardan aldık

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

## **DIŞ KAYNAKLI VERİ OKUMAK**

In [101]:
import pandas as pd

In [ ]:
#yüklemek istediğimiz dosyaları çalışma dizinimize getirememiz lazım

In [ ]:
pd.read_csv("dizin/ornekcsv.csv",sep=";") 
pd.read_csv("dizin/duz_metin.txt")  #txt dosyamızı csv yüklemesiyle yaptık
pd.read_excel("dizin/ornekx.xlsx")